
// const Home = () => {
//   return (<></>);
// };
import { Button, Container, Row, Col } from "react-bootstrap";

function DataFoods() {
  const foods = [
    {
      id: 1,
      name: 'ข้าวหมูทอดทงคัตสึ',
      image: 'mootod.jpg',
      desc: 'เริ่มกันที่ เมนูอาหารญี่ปุ่น ยอดฮิตอย่าง ข้าวหมูทอดทงคัตสึ ข้าวหมูทอดสไตล์ญี่ปุ่น ที่จะทำให้คุณหลังรักการกินหมูทอด ด้วยสัมผัสที่กรอบนอกนุ่มใน อร่อยได้ในคำเดียว ทำให้เป็นหนึ่งในเมนูยอดนิยมของคนไทยเลยก็ว่าได้ ซึ่งสูตรนี้ได้มาจาก เชฟโฌ เชฟชาวญี่ปุ่นแท้ ๆ เลยทีเดียว รับรองว่า ถ้าทำขาย รสชาติอร่อย ไม่แพ้ร้านอาหารญี่ปุ่นชื่อดังแน่นอน',
      price: 120,
      ingredient: 'หมูสันนอก, ไข่ไก่ 1 ฟอง, แป้งเค้ก 4 ช้อนโต๊ะ, น้ำเปล่า 2 ช้อนโต๊ะ, น้ำมันพืช 1 ช้อนโต๊ะ, แป้งเค้กสำหรับชุบเนื้อหมู, เกล็ดขนมปัง',
      method: 'ใช้กระดาษทิชชู่ ซับเนื้อหมูให้แห้ง ถ้ามีมันหมูและเอ็นหมู ติดกับเนื้อหมู ให้ใช้มีดหั่น ให้ขาดแยกออกจากกัน เพื่อเวลาทอด เนื้อหมูจะไม่งอหรือหดตัว ทั้ง 2 ด้าน จากนั้น ใช้ส้อมจิ้มเนื้อหมูให้มีรูพรุน แล้วใช้สันมีดทุบเนื้อหมูให้นุ่มลง แล้วเริ่มหมัก โดยใส่เกลือ พริกไทย ตามชอบ ทำแป้งชุบทอด โดยตอกไข่ไก่ ตีให้เข้ากัน จากนั้น ใส่แป้งเค้ก น้ำเปล่า น้ำมันพืช คนให้เข้ากัน จนเป็นลักษณะครีม เหนียวข้น นำเนื้อหมูชุบลงในแป้งเค้ก ตามด้วยแป้งชุบทอดและเกล็ดขนมปัง จากนั้น ตั้งกระทะ ใส่น้ำมันลงไป รอจนน้ำมันร้อนได้ที่ ประมาณ 170 องศาแล้ว ใส่เนื้อหมูลงไป ทอดจนหมูสีเหลืองทองกรอบ ใช้เวลา 4 นาที ครบเวลา ให้ตักขึ้น พักให้สะเด็ดน้ำมัน'

    },
    {
      id: 2,
      name: 'ข้าวหมูทอดคัตสึด้ง',
      image: 'kattsu.jpg',
      desc: 'ข้าวหมูทอด สไตล์ญี่ปุ่น ที่มีความแตกต่างจาก ข้าวหน้าหมูทงคัตสึ ตรงที่ หมูทอดนั้น จะถูกนำไปตุ๋นรวมกับไข่ แล้วราดลงบนข้าวอีกทีหนึ่ง ทำให้เป็น เมนูอาหารญี่ปุ่น ที่ได้รสชาติของซุปไข่ กินแล้วไม่ฝืด ลื่นคอกำลังดี',
      price: 130,
      ingredient: 'หมูสันนอก, ไข่ไก่ 1 ฟอง, หอมใหญ่ 1/2 ลูก, แป้งทอดกรอบ, เกล็ดขนมปัง, น้ำซุปชาบูน้ำดำแบบขวด 4 ช้อนโต๊ะ, น้ำเปล่า 2 ช้อนโต๊ะ',
      method: 'ปอกเปลือกหอมใหญ่ แล้วหั่นเป็นเส้นเล็ก ๆ เตรียมไว้ เตรียมหมูสันนอก โดยใช้กระดาษทิชชู่ซับเนื้อหมูให้แห้ง ถ้ามีมันหมูและเอ็นหมู ติดกับเนื้อหมู ให้ใช้มีดหั่น ให้ขาดแยกออกจากกัน เพื่อเวลาทอด เนื้อหมูจะไม่งอหรือหดตัว ทั้ง 2 ด้าน จากนั้น ใช้ส้อมจิ้มเนื้อหมูให้มีรูพรุน แล้วใช้สันมีดทุบเนื้อหมูให้นุ่มลง แล้วเริ่มหมัก โดยใส่เกลือ พริกไทย ตามชอบ ตอกไข่ไก่ ใบที่ 1 ใส่ชามผสม ตีให้เข้ากัน สำหรับเตรียมชุบหมู พร้อมกับเตรียมแป้งทอดกรอบ เกล็ดขนมปังเตรียมไว้ นำเนื้อหมูมาชุบแป้งทอดกรอบ ชุบไข่ ตามด้วย เกล็ดขนมปัง จากนั้น ตั้งกระทะ ใส่น้ำมันลงไป รอจนน้ำมันร้อนได้ที่แล้ว ใส่เนื้อหมูลงไป ทอดจนหมูสีเหลืองทองกรอบแล้ว ตักขึ้น พักให้สะเด็ดน้ำมัน เตรียมทำซุปไข่ โดยใส่น้ำซุปชาบูน้ำดำ 4 ช้อนโต๊ะ ผสมกับน้ำเปล่า 2 ช้อนโต๊ะให้เข้ากัน เตรียมไว้ จากนั้น ตั้งกระทะ แล้วนำหอมใหญ่มาผัดในกระทะ ให้นิ่มลง พอนิ่มลงดีแล้ว ให้เทน้ำซุปลงไป แล้วหั่นเนื้อหมูทอดเป็นชิ้น ๆ วางลงไป พอน้ำเดือดแล้ว ให้ตอกไข่ไก่ ใบที่ 2 ตีให้เข้ากัน แล้วเทลงไปในกระทะ ปิดฝาหม้อ ตุ๋นไข่ให้ได้ความสุกตามที่ต้องการ ใช้เวลาประมาณ 10 วินาที เป็นอันเสร็จ'
    },
    {
      id: 3,
      name: 'ข้าวแกงกะหรี่ญี่ปุ่น',
      image: 'kang.jpg',
      desc: 'อีกหนึ่งเมนู ข้าวหมูทอด สไตล์ เมนูอาหารญี่ปุ่น ที่อร่อยและเข้มข้นยิ่งขึ้น เมื่อได้แกงกะหรี่รสชาติเข้มข้นมาทานคู่กัน จะทำให้คุณได้เพลิดเพลิน กับทั้งรสชาติของแกงกะหรี่และหมูทอดในมื้อเดียว',
      price: 110,
      ingredient: 'หมูสันนอก 4 ชิ้น,สะโพกไก่ 200 กรัม, พริกแกงกะหรี่ญี่ปุ่น 120 กรัม, ไข่ไก่ 2 ฟอง, หอมใหญ่ 400 กรัม, น้ำมันรำข้าว 3 ช้อนโต๊ะ, ซอสมะเขือเทศ 2 ช้อนโต๊ะ, น้ำสต็อคดาชิแบบเข้มข้น 4 ช้อนโต๊ะ, น้ำสะอาด 3 ถ้วย, แป้งสาลีอเนกประสงค์, เกล็ดขนมปัง, ข้าวสวยญี่ปุ่น, ผักดอง',
      method: 'หั่นหอมใหญ่และสะโพกไก่ ออกเป็นชิ้นเล็ก ๆ ตั้งกระทะ ใส่น้ำมันรำข้าวลงไป ตามด้วยหอมใหญ่และสะโพกไก่ ผัดให้เข้ากันจนกว่าหอมใหญ่จะนิ่มลง ใส่น้ำเปล่า และ น้ำสต็อคดาชิแบบเข้มข้นลงไป คนให้เข้ากัน เคี่ยวด้วยไฟกลางค่อนไฟอ่อน พอน้ำซุปเริ่มงวดลงแล้ว ให้ใส่พริกแกงกะหรี่ญี่ปุ่น และซอสมะเขือเทศลงไป คนให้เข้ากัน จนกว่าพริกแกงกะหรี่ญี่ปุ่นจะละลาย จากนั้น เคี่ยวต่อไป จนเมื่อได้ซอสแกงกะหรี่ที่มีความข้นหนียวตามต้องการแล้ว ให้ปิดไฟ พักไว้  เตรียมทำหมูทอด โดยใช้ส้อมจิ้มเนื้อหมูให้ทั่ว จากนั้น โรยเกลือและพริกไทย แล้วนำไปชุบแป้งสาลี ไข่ไก่ และเกล็ดขนมปัง เสร็จแล้ว นำไปทอดในน้ำมันเดือดจัด จนมีสีเหลืองทองกรอบได้ที่แล้ว ให้ตักขึ้น พักให้สะเด็ดน้ำมัน จัดเสิร์ฟ ตักซอสแกงกะหรี่ราดข้าวสวยญี่ปุ่น แล้วหั่นหมูทอดเป็นชิ้น ๆ พร้อมกับผักดองไว้ข้าง ๆ เป็นอันเสร็จ'
    }
  ]

  function Foodprops(props) {
    return (
      <>
        <div>
          <img src={props.image} alt={props.name}
            className="img-fluid rounded-circle"
            style={{ marginTop: '10px' }} />
        </div>
        <div>
          <h1>{props.name}</h1>
        </div>
        <div >
          <h3>{props.desc}</h3>
        </div>
      </>
    );
  }


  return (
    <Container className="p-3 my-3">
      <Row className="border">
        <Col className="text-justify">
          <Foodprops
            name={foods[0].name}
            image={foods[0].image}
            desc={foods[0].desc} />
          <div className="text-center">
            <div>
              <Button
                className="btn btn-secondary m-1"
                onClick={foods[0].name}
              >ดูวิธีทำ </Button>
            </div>
          </div>
        </Col>
        <Col className="text-justify">
          <Foodprops
            name={foods[1].name}
            image={foods[1].image}
            desc={foods[1].desc} />
          <div className="text-center">
            <div>
              <Button className="btn btn-secondary m-1">ดูวิธีทำ </Button>
            </div>
          </div>
        </Col>
        <Col className="text-justify">
          <Foodprops
            name={foods[2].name}
            image={foods[2].image}
            desc={foods[2].desc} />
          <div className="text-center">
            <div>
              <Button className="btn btn-secondary m-1">ดูวิธีทำ </Button>
            </div>
          </div>
        </Col>
      </Row>
    </Container>
  )

}



function Home() {
  return (
    <Container className='p-3 my-3' >
      <Container>
        <h1>วิธีทำอาหารญี่ปุ่นยอดฮิต</h1>
      </Container>
      <DataFoods />
    </Container>
  )
}


export default Home;

